  
from pyrogram import *
import asyncio
import random

@Client.on_message(filters.text, group = 6)
async def help(client, message):

    if message.text == '/help':
      await message.reply("""
        
    غلام هستم غلام شما 😎

    چند تا کار انجام میدم که با دستورات زیر میتونید به من دستور بدید  🕵️

    🟢 ------ 1 -------------->
🔺 جستوجو در گوگل و پیدا کردن سه نتیجه اول با یک عکس رندوم از خود گوگل
    با دستور /gg
    مثال :
    /gg سرچ در گوگل
    🟢 ------ 2 -------------->
🔺 جستو عکس در گوگل در مورد هرچیزی بدون محدودیت
    با دستور /gis
    مثال:
    /gis موز
    🟢 ------ 3 -------------->
🔺 جستجو در ویکی پدیا با خلاصه
    با دستور /wiki
    مثال:
    /wiki مولانا
    🟢 ------ 4 -------------->
🔺 ترجمه انگلیسی به فارسی
    با دستور /tr
    مثال:
    /tr i'm legend
    🟢 ------ 5 -------------->
🔺 ترجمه فارسی به انگلیسی
    با دستور /trf
    مثال:
    /trf سامیار خیلی خوبه
    🟢 ------ 6 --- Beta ----->
🔺 نوشتن املای درست جملات فارسی یا انگلیسی (توجه کنید جملات)
    با دستور /em
    مثال:
    /em helllo howss goingg
    -------------------------

    😄 توجه داشته باش که یک فاصله حتما بزاری بعد از هر دستور و اگه دوست داشتی دوباره همین راهنما رو ببینی کافیه دستور /help رو بفرستی


      """)
